---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitStairs
source: html/10ef8953-8fd4-bf84-9718-10d3b670e768.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingCurvesNotSplitStairs Property

The slope of this railing may not parallel the stairs at runs and landings. To get a parallel railing, split the railing sketch at the ends of landings.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingCurvesNotSplitStairs { get; }
```